In [1]:
import pandas as pd

In [3]:
s = pd.Series(['a', 'b', 'c', 'd'])
s

0    a
1    b
2    c
3    d
dtype: object

In [4]:
df_helloworld = pd.DataFrame (
{'Name': ['Jacky', 'Henry'],
'Say': ['Hello', 'World']})
df_helloworld

    Name    Say
0  Jacky  Hello
1  Henry  World

In [5]:
df_helloworld = pd.DataFrame(
    [['Jacky', 'Hello'],
 ['Henry', 'World']],
 columns=['Name', 'Say Something']
)
df_helloworld

    Name Say Something
0  Jacky         Hello
1  Henry         World

In [11]:
df_helloworld = pd.DataFrame(
    [['Jacky', 'Hello', 28.5],
    ['Henry', 'World', 23]],  columns =['Name','Say','Grade'],
    dtype = float)
df_helloworld

    Name    Say  Grade
0  Jacky  Hello   28.5
1  Henry  World   23.0

In [21]:
df = pd.read_clipboard()
df

Empty DataFrame
Columns: [clipboard]
Index: []

In [26]:
url = 'https://www.littledataman.com/samples/credit.csv'
df_credit = pd.read_csv(url, parse_dates= ['Approval Date'])
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date
0,Jacky,White,825,True,Infinite,155000.62,2019-09-13 12:00:00
1,Jane,Nize,810,True,Golden,120800.88,2019-08-16 05:25:00
2,Henry,Tone,780,True,Golden,98000.58,2020-05-06 12:00:00
3,Desmond,Black,750,True,Silver,54000.00,2020-05-01 01:00:00
4,Eileen,Musk,620,False,Dividend,35000.00,NaT

In [27]:
df_credit.dtypes

First Name                 object
Last Name                  object
Credit Score                int64
Credit Approval              bool
Card Name                  object
Income                    float64
Approval Date      datetime64[ns]
dtype: object

In [30]:
df_credit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   First Name       5 non-null      object
 1   Last Name        5 non-null      object
 2   Credit Score     5 non-null      int64
 3   Credit Approval  5 non-null      bool
 4   Card Name        5 non-null      object
 5   Income           5 non-null      float64
 6   Approval Date    4 non-null      datetime64[ns]
dtypes: bool(1), datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 373.0+ bytes

In [32]:
df_credit['Income'].dtype

dtype('float64')

In [33]:
df_credit['Card Name'].dtype

dtype('O')

In [34]:
df_credit['Card Name'] = df_credit['Card Name'].astype('category')
df_credit['Card Name'].dtype

CategoricalDtype(categories=['Dividend', 'Golden', 'Infinite', 'Silver'], ordered=False)

In [36]:
df_credit.size

35

In [37]:
df_credit.values

array([['Jacky', 'White', 825, True, 'Infinite', 155000.62,
        Timestamp('2019-09-13 12:00:00')],
       ['Jane', 'Nize', 810, True, 'Golden', 120800.88,
        Timestamp('2019-08-16 05:25:00')],
       ['Henry', 'Tone', 780, True, 'Golden', 98000.58,
        Timestamp('2020-05-06 12:00:00')],
       ['Desmond', 'Black', 750, True, 'Silver', 54000.0,
        Timestamp('2020-05-01 01:00:00')],
       ['Eileen', 'Musk', 620, False, 'Dividend', 35000.0, NaT]],
      dtype=object)

In [38]:
df_credit.T

,0,1,2,3,4
First Name,Jacky,Jane,Henry,Desmond,Eileen
Last Name,White,Nize,Tone,Black,Musk
Credit Score,825,810,780,750,620
Credit Approval,True,True,True,True,False
Card Name,Infinite,Golden,Golden,Silver,Dividend
Income,155001,120801,98000.6,54000,35000
Approval Date,2019-09-13 12:00:00,2019-08-16 05:25:00,2020-05-06 12:00:00,2020-05-01 01:00:00,NaT